; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	image1 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Star6 image1)
	(have_image Planet7 image3)
	(have_image Star8 thermograph0)
	(have_image Planet9 image1)
	(have_image Planet10 thermograph2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
4. (take_image satellite0 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 1 of 6
5. (turn_to satellite0 planet10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet10)
   goals met: 1 of 6
6. (take_image satellite0 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 2 of 6
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 6
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
9. (turn_to satellite0 star2 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star2)
   goals met: 2 of 6
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 6
11. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 2 of 6
12. (take_image satellite0 planet7 instrument0 image3)
   added: (have_image planet7 image3)
   goals met: 3 of 6
13. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 3 of 6
14. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 4 of 6
15. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 4 of 6
16. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 5 of 6
17. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 6 of 6
